In [160]:
#create a dataframe on list dictionnary
product = [
    {'product_id':23, 'name':'computer', 'wholesale_price': 500, 'retail_price':1000, 'sales':100}, 
    {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,'retail_price':75, 'sales':1000},
    {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35, 'retail_price':75, 'sales':500},
    {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,'retail_price':1, 'sales':200},
    {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,'retail_price':5, 'sales':300}
]

In [161]:
import numpy as np
import pandas as pd

In [162]:
df = pd.DataFrame(product)

In [163]:
df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [164]:
#Step 2:  Calculate the Total Profit for each product using the formula : 
#net_revenue_per_product = (retail_price - wholesale price) * sales
net_revenue_per_product= (df.retail_price - df.wholesale_price) * df.sales

In [165]:
df['net_revenue']=net_revenue_per_product
df

,product_id,name,wholesale_price,retail_price,sales,net_revenue
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwich,3.0,5,300,600.0

In [166]:
#Step 3: Determine the following

# How much total net revenue you received from all of these sales?
total_revenue = net_revenue_per_product.sum()

In [167]:
total_revenue

110700.0

In [168]:
# What product is product retail price more than twice the wholesale price?
result = df.retail_price >(df.wholesale_price*2)

In [169]:
 df[result]

,product_id,name,wholesale_price,retail_price,sales,net_revenue
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0

In [170]:
#Comparing revenue made from computers vs books vs food
print (" The revenue made from computers is", df.loc[0,'net_revenue'])
df

 The revenue made from computers is 50000.0

,product_id,name,wholesale_price,retail_price,sales,net_revenue
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwich,3.0,5,300,600.0

In [171]:
#The revenue made from computers is
print (" The revenue made from computers is", df.loc[0,'net_revenue'])

 The revenue made from computers is 50000.0

In [172]:
#The revenue made from book is
books= df.loc[1:2, 'net_revenue'].sum(axis=0)
books

60000.0

In [173]:
print (" The revenue made from books is", books)

 The revenue made from books is 60000.0

In [174]:
#The revenue made from food is
food= df.loc[3:4, 'net_revenue'].sum(axis=0)

In [175]:
print (" The revenue made from books is", food)

 The revenue made from books is 700.0

In [176]:
#New wholesale price after 30% discount on wholesale price
new_wholesale =df.wholesale_price-(df.wholesale_price*0.3)

In [177]:
df['new_wholesale_price'] = new_wholesale

In [178]:
#New net revenue after change in wholesale price
new_net = (df.retail_price- df.new_wholesale_price)*df.sales
df['new_net_revenue'] = new_net_revenue

In [185]:
df

,product_id,name,wholesale_price,retail_price,sales,net_revenue,new_wholesale_price,new_net_revenue
0,23,computer,500.0,1000,100,50000.0,350.00,45.000
1,96,Python Workout,35.0,75,1000,40000.0,24.50,3.150
2,97,Pandas Workout,35.0,75,500,20000.0,24.50,3.150
3,15,banana,0.5,1,200,100.0,0.35,0.045
4,87,sandwich,3.0,5,300,600.0,2.10,0.270

In [187]:
df['name']

0          computer
1    Python Workout
2    Pandas Workout
3            banana
4          sandwich
Name: name, dtype: object